quanhengwen/STM32F1xWorkSpace19/Driver/WOW/SCR/STM32_USART - 20190813.C
/******************************** User_library *********************************
* 文件名 	: STM32_SDCard.H
* 作者   	: wegam@sina.com
* 版本   	: V
* 日期   	: 2016/01/01
* 说明   	: 
********************************************************************************
* THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
* WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE TIME.
* AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY DIRECT,
* INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING FROM THE
* CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE CODING
* INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
*******************************************************************************/


#include "STM32_USART.H"

#include "STM32_GPIO.H"
//#include "STM32_SYSTICK.H"
//#include 	"LinkedList.H"

#include "stm32f10x_dma.h"
#include "stm32f10x_gpio.h"
#include "stm32f10x_nvic.h"
#include "stm32f10x_rcc.h"

#include	"stdio.h"			//用于printf
#include	"string.h"		//用于printf
#include	"stdarg.h"		//用于获取不确定个数的参数
#include	"stdlib.h"		//malloc动态申请内存空间


/*##############################################################################
################################################################################
设置波特率时的误差计算
--------------------------------------------------------------------------------
波特率				|fPCLK = 36MHz	误差%			|		fPCLK = 72MHz	误差%			|
--------------------------------------------------------------------------------
2400				|						0%						|						0%							
--------------------------------------------------------------------------------
9600				|						0%						|						0%								
--------------------------------------------------------------------------------
19200				|						0%						|						0%							
--------------------------------------------------------------------------------
57600				|						0%						|						0%							
--------------------------------------------------------------------------------
115200			|						0.15%					|						0%							
--------------------------------------------------------------------------------
230400			|						0.16%					|						0.16%							
--------------------------------------------------------------------------------
460800			|						0.16%					|						0.16%							
--------------------------------------------------------------------------------
921600			|						0.16%					|						0.16%							
--------------------------------------------------------------------------------
2250000			|						0%						|						0%							
--------------------------------------------------------------------------------

################################################################################
###############################################################################*/

//--------USART全局变量定义
#define	uart_dma_buffer_size	1024	//默认串口DMA接收缓冲大小,如果配置时未输入缓存大小时使用的默认值
#define	uBaudRate	115200	//默认串口波特率

struct
{
  unsigned short nUSART1;
  unsigned short nUSART2;
  unsigned short nUSART3;
  unsigned short nUART4;
//  unsigned short nUART5;	  //----无DMA
}DmaSize;      //配置时设置的DMA接收缓存大小
struct
{
  unsigned short nUSART1;
  unsigned short nUSART2;
  unsigned short nUSART3;
  unsigned short nUART4;
//  unsigned short nUART5;	  //----无DMA
}RemaDmaSize;     //DMA开启后剩余DMA接收缓存大小，通过与设置的DMA缓存大小来判断数据是否在接收
struct
{
  unsigned short nUSART1;
  unsigned short nUSART2;
  unsigned short nUSART3;
  unsigned short nUART4;
//  unsigned short nUART5;	  //----无DMA
}rx_retry_count;
struct
{
  unsigned short nUSART1;
  unsigned short nUSART2;
  unsigned short nUSART3;
  unsigned short nUART4;
//  unsigned short nUART5;	  //----无DMA
}tx_retry_count;

struct
{
  unsigned char nUSART1	:1;
  unsigned char nUSART2	:1;
  unsigned char nUSART3	:1;
  unsigned char nUART4	:1;
  unsigned char nUART5	:1;	  //----无DMA
}usart_type;		//串口类型0---USART,1-RS485
struct
{
  unsigned char nUSART1	:1;
  unsigned char nUSART2	:1;
  unsigned char nUSART3	:1;
  unsigned char nUART4	:1;
  unsigned char nUART5	:1;	  //----无DMA
}usart_tx_idle_flag;		//空闲标志0---忙,1-空闲
struct
{
  unsigned char nUSART1	:1;
  unsigned char nUSART2	:1;
  unsigned char nUSART3	:1;
  unsigned char nUART4	:1;
  unsigned char nUART5	:1;	  //----无DMA
}usart_rx_idle_flag;		//空闲标志0---忙,1-空闲
struct
{
  RS485Def *rs485_usart1;
  RS485Def *rs485_usart2;
	RS485Def *rs485_usart3;
  RS485Def *rs485_uart4;
  RS485Def *rs485_uart5;
}rs485_addr;		//RS485地址

/* Private variables ---------------------------------------------------------*/
unsigned char uRx1Addr[uart_dma_buffer_size]={0};
unsigned char uRx2Addr[uart_dma_buffer_size]={0};
unsigned char uRx3Addr[uart_dma_buffer_size]={0};
unsigned char uRx4Addr[uart_dma_buffer_size]={0};

unsigned char uTx1Addr[uart_dma_buffer_size]={0};
unsigned char uTx2Addr[uart_dma_buffer_size]={0};
unsigned char uTx3Addr[uart_dma_buffer_size]={0};
unsigned char uTx4Addr[uart_dma_buffer_size]={0};
/* Private function prototypes -----------------------------------------------*/
//*****************RS485收发控制


/* function-------------------------------------------------------------------*/
/*******************************************************************************/








//-----------------------------------------------------------------------------
//-----------------------------------API---------------------------------------
//-----------------------------------------------------------------------------
/*******************************************************************************
* 函数名			:	USART_ReadBuffer
* 功能描述		:	串口空闲模式读串口接收缓冲区，如果有数据，将数据拷贝到RevBuffer,并返回接收到的数据个数，然后重新将接收缓冲区地址指向RxdBuffer， 
* 输入			: void
* 返回值			: void
*******************************************************************************/
unsigned short api_usart_dma_receive(USART_TypeDef* USARTx,u8 *RevBuffer)
{
	unsigned short len=0;
	if(get_usart_rx_idle(USARTx))
	{		
		len	= get_usart_rx_dma_buffer(USARTx,RevBuffer);
		del_usart_rx_idle(USARTx);
	}
	return len;
}
/*******************************************************************************
*函数名			:	RS485_ReadBufferIDLE
*功能描述		:	串口空闲模式读串口接收缓冲区，如果有数据，将数据拷贝到RevBuffer,并返回接收到的数据个数，然后重新将接收缓冲区地址指向RxdBuffer
*输入				: 
*返回值			:	无
*******************************************************************************/
unsigned short api_rs485_dma_receive(RS485Def *pRS485,u8 *RevBuffer)	//串口空闲模式读串口接收缓冲区，如果有数据，将数据拷贝到RevBuffer,并返回接收到的数据个数，然后重新将接收缓冲区地址指向RxdBuffer，
{
	USART_TypeDef* USARTx	=	pRS485->USARTx;
	if(get_usart_tx_idle(USARTx))
	{
		set_rs485_tx(pRS485,DISABLE);
		set_rs485_rx(pRS485,ENABLE);
		del_usart_tx_idle(USARTx);		
	}
	if(get_usart_rx_idle(USARTx))
	{
		unsigned short len=0;
		len	= get_usart_rx_dma_buffer(USARTx,RevBuffer);
		return len;
	}
	return 0;
}
//-----------------------------------------------------------------------------



