quanhengwen/STM32F1xWorkSpace19/Driver/WOW/SCR/STM32_USART - 20190813.C
/*******************************************************************************
*函数名			:	
*功能描述		:	串口DMA发送程序，如果数据已经传入到DMA，返回Buffer大小，否则返回0
*输入				: 
*返回值			:	如果数据已经传入到DMA，返回Buffer大小，否则返回0（发送器忙）
*******************************************************************************/
unsigned short api_usart_dma_send(USART_TypeDef* USARTx,u8 *tx_buffer,u16 BufferSize)		//串口DMA发送程序
{
	if(0==get_usart_tx_idle(USARTx))		//串口状态检查
		return 0;
	return set_usart_tx_dma_buffer(USARTx,tx_buffer,BufferSize);		//串口DMA发送程序	
}
/*******************************************************************************
*函数名			:	
*功能描述		:	串口DMA发送程序，如果数据已经传入到DMA，返回Buffer大小，否则返回0
*输入				: 
*返回值			:	如果数据已经传入到DMA，返回Buffer大小，否则返回0（发送器忙）
*******************************************************************************/
unsigned short api_rs485_dma_send(RS485Def *pRS485,u8 *tx_buffer,u16 BufferSize)		//RS485-DMA发送程序
{
	//-------------接收空闲和发送空闲
  unsigned short sendedlen  =0;
	if(get_usart_tx_idle(pRS485->USARTx)&&get_usart_rx_idle(pRS485->USARTx))
	{
		set_rs485_tx(pRS485,ENABLE);
		set_rs485_rx(pRS485,DISABLE);
		sendedlen = set_usart_tx_dma_buffer(pRS485->USARTx,(u8*)tx_buffer,BufferSize);		//串口DMA发送程序
	}
	return sendedlen;
}
/*******************************************************************************
*函数名		: function
*功能描述	:	串口接收服务函数
*输入			: 
*输出			:	无
*返回值		:	无
*例程			:	api_usart_dma_printf(USART2,"中文ENG=%d\n",num);
*特别说明	:	在DMA发送完成后需要释放动态空间，free(USART_BUFFER);
					:	USART_BUFFER定义在STM32_USART.H
*******************************************************************************/
unsigned short api_usart_dma_printf(USART_TypeDef* USARTx,const char *format,...)
{
	
//		va_list ap; 										//VA_LIST 是在C语言中解决变参问题的一组宏，所在头文件：#include <stdarg.h>,用于获取不确定个数的参数
//    static char string[ 256 ];			//定义数组，
//    va_start( ap, format );
//    vsprintf( string , format, ap );    
//    va_end( ap );	

	unsigned short	str_len=0;
	unsigned char		format_buffer[256]={0};
	
	//3)**********args为定义的一个指向可变参数的变量，va_list以及下边要用到的va_start,va_end都是是在定义，可变参数函数中必须要用到宏， 在stdarg.h头文件中定义
	va_list args;  
	//5)**********初始化args的函数，使其指向可变参数的第一个参数，format是可变参数的前一个参数
	va_start(args, format);
	//6)**********正常情况下返回生成字串的长度(除去\0),错误情况返回负值
	str_len = vsprintf((char*)format_buffer, format, args);
	//7)**********结束可变参数的获取
	va_end(args); 
	//8)**********将等发送缓冲区大小（数据个数）及缓冲区地址发给DMA开启发送	
	if(0==get_usart_tx_idle(USARTx))		//串口发送是否空闲
		return 0;
	return set_usart_tx_dma_buffer(USARTx,(u8*)format_buffer,str_len);		//串口DMA发送程序
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	函数功能说明
*输入				: 
*返回值			:	无
*******************************************************************************/
unsigned short api_rs485_dma_printf(RS485Def *pRS485,const char *format,...)
{
		
//		va_list ap; 										//VA_LIST 是在C语言中解决变参问题的一组宏，所在头文件：#include <stdarg.h>,用于获取不确定个数的参数
//    static char string[ 256 ];			//定义数组，
//    va_start( ap, format );
//    vsprintf( string , format, ap );    
//    va_end( ap );
	//2)**********定义缓冲区大小变量
	unsigned short	str_len;
	unsigned char		format_buffer[256]={0};
	//3)**********args为定义的一个指向可变参数的变量，va_list以及下边要用到的va_start,va_end都是是在定义，可变参数函数中必须要用到宏， 在stdarg.h头文件中定义
	va_list args;  
	//5)**********初始化args的函数，使其指向可变参数的第一个参数，format是可变参数的前一个参数
	va_start(args, format);
	//6)**********正常情况下返回生成字串的长度(除去\0),错误情况返回负值
	str_len = vsprintf((char*)format_buffer, format, args);
	//7)**********结束可变参数的获取
	va_end(args); 
	//8)**********将等发送缓冲区大小（数据个数）及缓冲区地址发给DMA开启发送
	//8)**********DMA发送完成后注意应该释放缓冲区：free(USART_BUFFER);
	if(get_usart_rx_idle(pRS485->USARTx))
	{
		set_rs485_tx(pRS485,ENABLE);
		set_rs485_rx(pRS485,DISABLE);
		return set_usart_tx_dma_buffer(pRS485->USARTx,(u8*)format_buffer,str_len);		//串口DMA发送程序
	}
	else
		return 0;
}
//-----------------------------------------------------------------------------



//-----------------------------------------------------------------------------API-configuration
/*******************************************************************************
*函数名			:	USART_DMA_ConfigurationNr
*功能描述		:	USART_DMA配置--查询方式，不开中断
*输入				: 
*返回值			:	无
*******************************************************************************/
void api_usart_dma_configurationST(USART_TypeDef* USARTx,USART_InitTypeDef* USART_InitStructure,unsigned short BufferSize)	//USART_DMA配置--结构体形式，不开中断
{
	usart_rcc_initialize(USARTx);
	usart_rcc_initialize(USARTx);
	usart_gpio_initialize(USARTx);										//串口GPIO配置
	usart_initialize_st(USARTx,USART_InitStructure);	//USART_DMA配置--查询方式，不开中断
	usart_dma_initialize(USARTx,BufferSize);					//USART_DMA配置--查询方式，不开中断
}
/*******************************************************************************
*函数名			:	USART_DMA_ConfigurationNr
*功能描述		:	USART_DMA配置--查询方式，不开中断
*输入				: 
*返回值			:	无
*******************************************************************************/
void api_usart_dma_configurationNR(USART_TypeDef* USARTx,u32 USART_BaudRate,unsigned short BufferSize)	//USART_DMA配置--查询方式，不开中断
{
	usart_rcc_initialize(USARTx);
	usart_gpio_initialize(USARTx);							//串口GPIO配置
	usart_initialize_nr(USARTx,USART_BaudRate);	//USART_DMA配置--查询方式，不开中断
	usart_dma_initialize(USARTx,BufferSize);		//USART_DMA配置--查询方式，不开中断
}
/*******************************************************************************
*函数名			:	USART_DMA_ConfigurationNr
*功能描述		:	USART_DMA配置--查询方式，不开中断,配置完默认为接收状态
*输入				: 
*返回值			:	无
*******************************************************************************/
void api_rs485_dma_configurationNR(RS485Def *pRS485,u32 USART_BaudRate,unsigned short BufferSize)	//USART_DMA配置--查询方式，不开中断,配置完默认为接收状态
{	
	set_usart_type(pRS485->USARTx,1);		//设置串口类型：0---USART,1-RS485
	set_rs485_addr(pRS485);
	
	if(pRS485->RS485_CTL_PORT)
		GPIO_Configuration_OPP50	(pRS485->RS485_CTL_PORT,pRS485->RS485_CTL_Pin);			//将GPIO相应管脚配置为APP(复用推挽)输出模式，最大速度50MHz----V20170605
	
	if(pRS485->RS485_TxEn_PORT)
		GPIO_Configuration_OPP50	(pRS485->RS485_TxEn_PORT,pRS485->RS485_TxEn_Pin);			//将GPIO相应管脚配置为APP(复用推挽)输出模式，最大速度50MHz----V20170605
	
	if(pRS485->RS485_RxEn_PORT)
		GPIO_Configuration_OPP50	(pRS485->RS485_RxEn_PORT,pRS485->RS485_RxEn_Pin);			//将GPIO相应管脚配置为APP(复用推挽)输出模式，最大速度50MHz----V20170605	
	
	set_rs485_tx(pRS485,DISABLE);
	set_rs485_rx(pRS485,ENABLE);
	usart_rcc_initialize(pRS485->USARTx);
	usart_gpio_initialize(pRS485->USARTx);							//串口GPIO配置	
	usart_initialize_nr(pRS485->USARTx,USART_BaudRate);	//USART_DMA配置--查询方式，不开中断
	usart_dma_initialize(pRS485->USARTx,BufferSize);		//USART_DMA配置--查询方式，不开中断
}
/*******************************************************************************
*函数名			:	USART_DMA_ConfigurationNr
*功能描述		:	USART_DMA配置--查询方式，不开中断
*输入				: 
*返回值			:	无
*******************************************************************************/
void api_usart_dma_configuration_even(USART_TypeDef* USARTx,u32 USART_BaudRate,unsigned short BufferSize)	//USART_DMA配置--查询方式，不开中断,偶校验
{
	usart_rcc_initialize(USARTx);
	usart_gpio_initialize(USARTx);							//串口GPIO配置
	usart_initialize_even(USARTx,USART_BaudRate);	//USART_DMA配置--查询方式，不开中断--偶校验
	usart_dma_initialize(USARTx,BufferSize);		//USART_DMA配置--查询方式，不开中断
}
/*******************************************************************************
*函数名			:	USART_DMA_ConfigurationNr
*功能描述		:	USART_DMA配置--查询方式，不开中断
*输入				: 
*返回值			:	无
*******************************************************************************/
void api_usart_dma_configuration_odd(USART_TypeDef* USARTx,u32 USART_BaudRate,unsigned short BufferSize)	//USART_DMA配置--查询方式，不开中断,偶校验
{
	usart_rcc_initialize(USARTx);
	usart_gpio_initialize(USARTx);							//串口GPIO配置
	usart_initialize_odd(USARTx,USART_BaudRate);	//USART_DMA配置--查询方式，不开中断--偶校验
	usart_dma_initialize(USARTx,BufferSize);		//USART_DMA配置--查询方式，不开中断
}
/*******************************************************************************
*函数名			:	USART_DMA_ConfigurationNr
*功能描述		:	USART_DMA配置--中断方式
*输入				: 
*返回值			:	无
*******************************************************************************/
void api_usart_dma_configuration_idleIT(USART_TypeDef* USARTx,u32 USART_BaudRate,unsigned short BufferSize)	//USART_DMA配置--中断方式
{
  //2)******************************GPIO配置
	usart_rcc_initialize(USARTx);
  usart_gpio_initialize(USARTx);                //串口GPIO配置
  //2)******************************中断配置
  usart_it_initialize(USARTx);	                //串口中断配置	
	
	USART_ITConfig(USARTx,USART_IT_IDLE, ENABLE);					//使用空闲中断，DMA自动接收，检测到总线空闲表示发送端已经发送完成，数据保存在DMA缓冲器中
	USART_ClearITPendingBit(USARTx,USART_IT_IDLE); 				//清除空闲串口标志位
	
	USART_Cmd(USARTx, ENABLE);
  
  //2)******************************DMA
  usart_dma_initialize(USARTx,BufferSize);	//USART_DMA配置--查询方式，不开中断
}
/*******************************************************************************
*函数名			:	USART_DMA_ConfigurationNr
*功能描述		:	USART_DMA配置--查询方式，不开中断
*输入				: 
*返回值			:	无
*******************************************************************************/
void api_usart_dma_configurationNR_Remap(USART_TypeDef* USARTx,u32 USART_BaudRate,unsigned short BufferSize)	//USART_DMA配置--完全映射，不开中断
{
	usart_gpio_initialize_Remap(USARTx);				//串口GPIO配置--完全映射
	usart_initialize_nr(USARTx,USART_BaudRate);	//USART_DMA配置--查询方式，不开中断
	usart_dma_initialize(USARTx,BufferSize);		//USART_DMA配置--查询方式，不开中断
}
/*******************************************************************************
*函数名			:	USART_DMA_ConfigurationNr
*功能描述		:	USART_DMA配置--查询方式，不开中断,配置完默认为接收状态
*输入				: 
*返回值			:	无
*******************************************************************************/
void api_rs485_dma_configurationNR_Remap(RS485Def *pRS485,u32 USART_BaudRate,unsigned short BufferSize)	//USART_DMA配置--完全映射
{
	usart_gpio_initialize_Remap(pRS485->USARTx);				//串口GPIO配置--完全映射
	usart_initialize_nr(pRS485->USARTx,USART_BaudRate);	//USART_DMA配置--查询方式，不开中断
	usart_dma_initialize(pRS485->USARTx,BufferSize);		//USART_DMA配置--查询方式，不开中断
	set_rs485_addr(pRS485);
	if(pRS485->RS485_CTL_PORT)
		GPIO_Configuration_OPP50	(pRS485->RS485_CTL_PORT,pRS485->RS485_CTL_Pin);			//将GPIO相应管脚配置为APP(复用推挽)输出模式，最大速度50MHz----V20170605
	
	if(pRS485->RS485_TxEn_PORT)
		GPIO_Configuration_OPP50	(pRS485->RS485_CTL_PORT,pRS485->RS485_TxEn_Pin);			//将GPIO相应管脚配置为APP(复用推挽)输出模式，最大速度50MHz----V20170605
	
	if(pRS485->RS485_RxEn_PORT)
		GPIO_Configuration_OPP50	(pRS485->RS485_CTL_PORT,pRS485->RS485_RxEn_Pin);			//将GPIO相应管脚配置为APP(复用推挽)输出模式，最大速度50MHz----V20170605	
	
	set_rs485_tx(pRS485,DISABLE);
	set_rs485_rx(pRS485,ENABLE);
}
//-----------------------------------------------------------------------------
/*******************************************************************************
*函数名			:	USART_DMA_ConfigurationNr
*功能描述		:	USART_DMA配置--查询方式，不开中断,配置完默认为接收状态
*输入				: 
*返回值			:	无
*******************************************************************************/
void api_rs485_dma_configurationIT(RS485Def *pRS485,u32 USART_BaudRate,unsigned short BufferSize)	//USART_DMA配置--完全映射
{
	USART_TypeDef* USARTx	=	pRS485->USARTx;
	usart_rcc_initialize(USARTx);
	usart_gpio_initialize(USARTx);				//串口GPIO配置--完全映射
	usart_initialize_nr(USARTx,USART_BaudRate);	//USART_DMA配置--查询方式，不开中断
	usart_it_initialize(USARTx);	            	//串口中断配置
	
