quanhengwen/STM32F1xWorkSpace19/Driver/WOW/SCR/STM32_USART - 20190813.C
	set_usart_type(pRS485->USARTx,1);		//设置串口类型：0---USART,1-RS485
	set_rs485_addr(pRS485);	
	
	USART_Cmd(USARTx, ENABLE);
	/* Enable USART1 Receive and Transmit interrupts */
//  USART_ITConfig(USARTx, USART_IT_RXNE, ENABLE);
//  USART_ITConfig(USARTx, USART_IT_TXE, ENABLE);
	USART_ITConfig(USARTx, USART_IT_TC, ENABLE);
	USART_ClearITPendingBit(USARTx,USART_IT_TC); 					//清除空闲串口标志位
	
	USART_ITConfig(USARTx,USART_IT_IDLE, ENABLE);					//使用空闲中断，DMA自动接收，检测到总线空闲表示发送端已经发送完成，数据保存在DMA缓冲器中
	USART_ClearITPendingBit(USARTx,USART_IT_IDLE); 				//清除空闲串口标志位
	
	if(pRS485->RS485_CTL_PORT)
		GPIO_Configuration_OPP50	(pRS485->RS485_CTL_PORT,pRS485->RS485_CTL_Pin);			//将GPIO相应管脚配置为APP(复用推挽)输出模式，最大速度50MHz----V20170605
	
	if(pRS485->RS485_TxEn_PORT)
		GPIO_Configuration_OPP50	(pRS485->RS485_CTL_PORT,pRS485->RS485_TxEn_Pin);			//将GPIO相应管脚配置为APP(复用推挽)输出模式，最大速度50MHz----V20170605
	
	if(pRS485->RS485_RxEn_PORT)
		GPIO_Configuration_OPP50	(pRS485->RS485_CTL_PORT,pRS485->RS485_RxEn_Pin);			//将GPIO相应管脚配置为APP(复用推挽)输出模式，最大速度50MHz----V20170605	
	
	set_rs485_tx(pRS485,DISABLE);
	set_rs485_rx(pRS485,ENABLE);
	
	usart_dma_initialize(USARTx,BufferSize);		//USART_DMA配置--查询方式，不开中断	
}
//-----------------------------------------------------------------------------
/*******************************************************************************
*函数名			:	USART_ConfigurationIT
*功能描述		:	USART_配置---常规中断方式
*输入				: 
*返回值			:	无
*修改时间		:	2018/01/06
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void api_usart_configuration_it(USART_TypeDef* USARTx,u32 USART_BaudRate)	//USART_中断方式配置
{
	//1)**********定义变量	
	usart_rcc_initialize(USARTx);
	usart_gpio_initialize(USARTx);						//串口GPIO配置
	usart_it_initialize(USARTx);	           	//串口中断配置	
	
	USART_ITConfig(USARTx,USART_IT_IDLE, ENABLE);					//使用空闲中断，DMA自动接收，检测到总线空闲表示发送端已经发送完成，数据保存在DMA缓冲器中
	USART_ClearITPendingBit(USARTx,USART_IT_IDLE); 				//清除空闲串口标志位
	
	/* Enable USART1 Receive and Transmit interrupts */
  USART_ITConfig(USARTx, USART_IT_RXNE, ENABLE);
//  USART_ITConfig(USARTx, USART_IT_TXE, ENABLE);
	USART_ITConfig(USARTx, USART_IT_TC, ENABLE);
	
	USART_ClearITPendingBit(USARTx, USART_IT_RXNE);
	USART_ClearITPendingBit(USARTx, USART_IT_TC);
	
	USART_Cmd(USARTx, ENABLE);
}
//-----------------------------------------------------------------------------






//-----------------------------------------------------------------------------
//---------------------------------static1-------------------------------------
//-----------------------------------------------------------------------------
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void usart_rcc_initialize(USART_TypeDef* USARTx)
{
	switch(*(u32*)&USARTx)
	{
		case 	USART1_BASE:
					RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE);	//USART1时钟开启			
					break;
		case 	USART2_BASE:
					RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, ENABLE);	//USART2时钟开启		
					break;
		case 	USART3_BASE:
					RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART3, ENABLE);	//USART3时钟开启		
					break;
		case 	UART4_BASE:
					RCC_APB1PeriphClockCmd(RCC_APB1Periph_UART4, ENABLE);	//UART4时钟开启	
					break;
		case 	UART5_BASE:   //UART5不支持DMA
					RCC_APB1PeriphClockCmd(RCC_APB1Periph_UART5, ENABLE);	//UART4时钟开启	
					break;
		default :break;
	}
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO,ENABLE);
}
//------------------------------------------------------------------------------

/*******************************************************************************
*函数名			:	USART_DMA_ConfigurationNr
*功能描述		:	USART_DMA配置--查询方式，不开中断
*输入				: 
*返回值			:	无
*******************************************************************************/
static void	usart_gpio_initialize(USART_TypeDef* USARTx)	//串口GPIO配置
{
	//1)**********定义变量	
	GPIO_InitTypeDef GPIO_InitStructure;					//GPIO结构体
	u16 TXD_Pin=0;																//串口发送脚
	u16 RXD_Pin=0;																//串口接收脚
	GPIO_TypeDef* GPIO_TX=0;
	GPIO_TypeDef* GPIO_RX=0;
	switch(*(u32*)&USARTx)
	{
		case 	USART1_BASE:
			
					GPIO_TX=GPIOA;
					GPIO_RX=GPIOA;
					TXD_Pin=GPIO_Pin_9;											//USART1-TX>PA9
					RXD_Pin=GPIO_Pin_10;										//USART1-RX>PA10
					RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA|RCC_APB2Periph_AFIO,ENABLE);
					break;
		case 	USART2_BASE:
			
					GPIO_TX=GPIOA;
					GPIO_RX=GPIOA;
					TXD_Pin=GPIO_Pin_2;		//USART2-TX>PA2
					RXD_Pin=GPIO_Pin_3;		//USART2-RX>PA3
					RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA|RCC_APB2Periph_AFIO,ENABLE);
					break;
		case 	USART3_BASE:
			
					GPIO_TX=GPIOB;
					GPIO_RX=GPIOB;
					TXD_Pin=GPIO_Pin_10;	//USART3-TX>PB10
					RXD_Pin=GPIO_Pin_11;	//USART3-RX>PB11
					
					RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO,ENABLE);				//关闭AFIO时钟,为关闭JTAG功能
					GPIO_PinRemapConfig(GPIO_Remap_SWJ_JTAGDisable, ENABLE);  //关闭JTAG功能
					RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB,ENABLE);
					break;
		case 	UART4_BASE:

					GPIO_TX=GPIOC;
					GPIO_RX=GPIOC;
					TXD_Pin=GPIO_Pin_10;	//USART1-TX>PC10
					RXD_Pin=GPIO_Pin_11;	//USART1-RX>PC11
					
					RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC|RCC_APB2Periph_AFIO,ENABLE);
					break;
		case 	UART5_BASE:   //UART5不支持DMA
			
          GPIO_TX=GPIOC;
					GPIO_RX=GPIOD;
					TXD_Pin=GPIO_Pin_10;	//USART1-TX>PC12
					RXD_Pin=GPIO_Pin_2; 	//USART1-RX>PD2
          RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC|RCC_APB2Periph_GPIOD|RCC_APB2Periph_AFIO,ENABLE);
					break;
		default :break;
	}
	//3)**********初始化串口
	//3.1)**********初始化TXD引脚
	GPIO_InitStructure.GPIO_Pin 		= TXD_Pin;
	GPIO_InitStructure.GPIO_Mode 		= GPIO_Mode_AF_PP;
	GPIO_InitStructure.GPIO_Speed 	= GPIO_Speed_50MHz;
	GPIO_Init(GPIO_TX,&GPIO_InitStructure);

	//3.2)**********初始化RXD引脚
	GPIO_InitStructure.GPIO_Pin 		= RXD_Pin;
	GPIO_InitStructure.GPIO_Mode 		= GPIO_Mode_IPU;							//上拉输入
	GPIO_Init(GPIO_RX,&GPIO_InitStructure);
}
/*******************************************************************************
*函数名			:	usart_gpio_initialize_Remap
*功能描述		:	USART_GPIO完全映射配置
*输入				: 
*返回值			:	无
*******************************************************************************/
static void	usart_gpio_initialize_Remap(USART_TypeDef* USARTx)	//USART_GPIO完全映射配置
{
	//1)**********定义变量	
	GPIO_InitTypeDef GPIO_InitStructure;					//GPIO结构体
	
	u16 TXD_Pin=0;																//串口发送脚
	u16 RXD_Pin=0;																//串口接收脚
	GPIO_TypeDef* GPIO_TX=0;
	GPIO_TypeDef* GPIO_RX=0;

	//2)******************************配置相关GPIO/串口时钟打开
	//2.1)**********USART1
	if(USARTx==USART1)
	{
		TXD_Pin=GPIO_Pin_6;									  //USART1-TX>PA9
		RXD_Pin=GPIO_Pin_7;										//USART1-RX>PA10
		
		GPIO_TX=GPIOB;
		GPIO_RX=GPIOB;
		
		GPIO_PinRemapConfig(GPIO_Remap_USART1,ENABLE);				//I/O口重映射开启
		RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB|RCC_APB2Periph_AFIO,ENABLE);
		RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE);	//USART1时钟开启

