quanhengwen/STM32F1xWorkSpace19/Driver/WOW/SCR/STM32_USART - 20190813.C
	}
	//2.2)**********USART2
	else if(USARTx==USART2)
	{		
		TXD_Pin=GPIO_Pin_5;		//USART2-TX>PA2
		RXD_Pin=GPIO_Pin_6;		//USART2-RX>PA3
		
		GPIO_TX=GPIOD;
		GPIO_RX=GPIOD;
		
		GPIO_PinRemapConfig(GPIO_Remap_USART2,ENABLE);				//I/O口重映射开启
		RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO,ENABLE);
		RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOD,ENABLE);
		RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, ENABLE);	//USART1时钟开启

	}
	//2.3)**********USART3
	else if(USARTx==USART3)
	{		
		TXD_Pin=GPIO_Pin_8;	//USART3-TX>PB10
		RXD_Pin=GPIO_Pin_9;	//USART3-RX>PB11
		
		GPIO_TX=GPIOD;
		GPIO_RX=GPIOD;
		
		GPIO_PinRemapConfig(GPIO_FullRemap_USART3,ENABLE);				//I/O口重映射开启
		RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO,ENABLE);
		RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOD,ENABLE);
		RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART3, ENABLE);	//USART1时钟开启
	}
	//2.4)**********USART4
	else if(USARTx==UART4)	//无映射
	{
		return;
	}
	//2.5)**********USART5
	else if(USARTx==UART5)	//无映射
	{		
		return;
	}
	//3)**********初始化串口
	//3.1)**********初始化TXD引脚
	GPIO_InitStructure.GPIO_Pin = TXD_Pin;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIO_TX,&GPIO_InitStructure);

	//3.2)**********初始化RXD引脚
	GPIO_InitStructure.GPIO_Pin = RXD_Pin;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;							//上拉输入
	GPIO_Init(GPIO_RX,&GPIO_InitStructure);	
}
//-----------------------------------------------------------------------------

/*******************************************************************************
*函数名			:	USART_DMA_ConfigurationNr
*功能描述		:	USART_DMA配置--查询方式，不开中断
*输入				: 
*返回值			:	无
*******************************************************************************/
static void usart_initialize_st(USART_TypeDef* USARTx,USART_InitTypeDef* USART_InitStructure)	//USART标准配置
{
	//3.3)**********初始化串口参数
	USART_DeInit(USARTx);
	
	USART_InitStructure->USART_Mode        = USART_Mode_Rx | USART_Mode_Tx;
	USART_InitStructure->USART_HardwareFlowControl = USART_HardwareFlowControl_None;//流控
	
	USART_Init(USARTx, USART_InitStructure);								//初始化串口
	
  USART_ITConfig(USARTx,USART_IT_IDLE, DISABLE);					//使用空闲中断，DMA自动接收，检测到总线空闲表示发送端已经发送完成，数据保存在DMA缓冲器中
	USART_ClearITPendingBit(USARTx,USART_IT_IDLE); 					//清除空闲串口标志位
	USART_Cmd(USARTx, ENABLE);
  //2)******************************DMA
}
/*******************************************************************************
*函数名			:	USART_DMA_ConfigurationNr
*功能描述		:	USART_DMA配置--查询方式，不开中断
*输入				: 
*返回值			:	无
*******************************************************************************/
static void usart_initialize_nr(USART_TypeDef* USARTx,u32 USART_BaudRate)	//USART_DMA配置--查询方式，不开中断
{
	USART_InitTypeDef USART_InitStructure;				//USART结构体	
	//3.3)**********初始化串口参数
	USART_DeInit(USARTx);
	USART_InitStructure.USART_BaudRate    = USART_BaudRate; 					  //波特率
	USART_InitStructure.USART_WordLength  = USART_WordLength_8b;		    //数据位
	USART_InitStructure.USART_StopBits    = USART_StopBits_1;				    //停止位
	USART_InitStructure.USART_Parity      = USART_Parity_No ; 					//奇偶校验
	USART_InitStructure.USART_Mode        = USART_Mode_Rx | USART_Mode_Tx;
	USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;//流控
	USART_Init(USARTx, &USART_InitStructure);											//初始化串口
	
  USART_ITConfig(USARTx,USART_IT_IDLE, DISABLE);					//使用空闲中断，DMA自动接收，检测到总线空闲表示发送端已经发送完成，数据保存在DMA缓冲器中
	USART_ClearITPendingBit(USARTx,USART_IT_IDLE); 					//清除空闲串口标志位
	USART_Cmd(USARTx, ENABLE);
  //2)******************************DMA
}
/*******************************************************************************
*函数名			:	USART_DMA_ConfigurationNr
*功能描述		:	USART_DMA配置--查询方式，不开中断
*输入				: 
*返回值			:	无
*******************************************************************************/
static void usart_initialize_even(USART_TypeDef* USARTx,u32 USART_BaudRate)	//USART_DMA配置--查询方式，不开中断--偶校验
{
	//1)**********定义变量	
	
	USART_InitTypeDef USART_InitStructure;				//USART结构体
	//3.3)**********初始化串口参数
	USART_DeInit(USARTx);
	USART_InitStructure.USART_BaudRate 		= USART_BaudRate; 			//波特率
	USART_InitStructure.USART_WordLength 	= USART_WordLength_9b;	//数据位
	USART_InitStructure.USART_StopBits 		= USART_StopBits_1;			//停止位
	USART_InitStructure.USART_Parity 			= USART_Parity_Even ; 	//偶校验
	USART_InitStructure.USART_Mode				= USART_Mode_Rx | USART_Mode_Tx;
	USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;//流控
	USART_Init(USARTx, &USART_InitStructure);											//初始化串口
	

	USART_ITConfig(USARTx,USART_IT_IDLE, DISABLE);					//使用空闲中断，DMA自动接收，检测到总线空闲表示发送端已经发送完成，数据保存在DMA缓冲器中
	USART_ClearITPendingBit(USARTx,USART_IT_IDLE); 					//清除空闲串口标志位
	
	USART_Cmd(USARTx, ENABLE);
}
/*******************************************************************************
*函数名			:	USART_DMA_ConfigurationNr
*功能描述		:	USART_DMA配置--查询方式，不开中断
*输入				: 
*返回值			:	无
*******************************************************************************/
static void usart_initialize_odd(USART_TypeDef* USARTx,u32 USART_BaudRate)	//USART_DMA配置--查询方式，不开中断--奇校验
{
	//1)**********定义变量	
	USART_InitTypeDef USART_InitStructure;				//USART结构体
	//3.3)**********初始化串口参数
	USART_DeInit(USARTx);
	USART_InitStructure.USART_BaudRate = USART_BaudRate; 					//波特率
	USART_InitStructure.USART_WordLength = USART_WordLength_9b;		//数据位
	USART_InitStructure.USART_StopBits = USART_StopBits_1;				//停止位
	USART_InitStructure.USART_Parity = USART_Parity_Odd ; 				//奇偶校验-奇校验
	USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
	USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;//流控
	USART_Init(USARTx, &USART_InitStructure);											//初始化串口
	
	USART_ITConfig(USARTx,USART_IT_IDLE, DISABLE);					//使用空闲中断，DMA自动接收，检测到总线空闲表示发送端已经发送完成，数据保存在DMA缓冲器中
	USART_ClearITPendingBit(USARTx,USART_IT_IDLE); 					//清除空闲串口标志位
	
	USART_Cmd(USARTx, ENABLE);
}
/*******************************************************************************/
static void	usart_dma_initialize(USART_TypeDef* USARTx,u16 BufferSize)	//USART_DMA配置--查询方式，不开中断
{
	//1)**********定义变量	
	DMA_InitTypeDef DMA_Initstructure;
	
	unsigned char*	uart_rxd	=	get_usart_rx_data_addr(USARTx);
	unsigned short 	dma_size	=	set_usart_dma_buffer_size(USARTx,BufferSize);
	
	DMA_Channel_TypeDef* DMAx_Channeltx=get_usart_tx_dma_channel(USARTx);			//DMA发送通道请求信号---当DMA串口发送数据完成时，会发起DMA中断
	DMA_Channel_TypeDef* DMAx_Channelrx=get_usart_rx_dma_channel(USARTx);			//DMA接收通道请求信号---DMA串口接收由串口发起中断，因此此处接收通道中断不使用	
	if(0==uart_rxd)
		return;
	if(0==DMAx_Channeltx)
		return;
	if(0==DMAx_Channelrx)
		return;
	//4)**********根据串口索引相关DMA通道及其它参数
	switch(*(u32*)&USARTx)
	{
		case 	USART1_BASE:
					RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1,ENABLE);	
					break;
		case 	USART2_BASE:
					RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1,ENABLE);
					break;
		case 	USART3_BASE:
					RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1,ENABLE);
					break;
		case 	UART4_BASE:
					RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA2,ENABLE);
					break;
		case 	UART5_BASE:
					//UART5不支持DMA
					return;
		default :break;
	}

	//5)**********DMA发送初始化，外设作为DMA的目的端
	DMA_Initstructure.DMA_PeripheralBaseAddr  = (u32)(&USARTx->DR);						//DMA外设源地址
	DMA_Initstructure.DMA_MemoryBaseAddr      = (u32)uart_rxd;								//DMA数据内存地址
	DMA_Initstructure.DMA_DIR                 = DMA_DIR_PeripheralDST;			  //DMA_DIR_PeripheralDST（外设作为DMA的目的端），DMA_DIR_PeripheralSRC（外设作为数据传输的来源）
	DMA_Initstructure.DMA_BufferSize          = 0; 								  					//指定DMA通道的DMA缓存的大小
	DMA_Initstructure.DMA_PeripheralInc       = DMA_PeripheralInc_Disable;	  //DMA_PeripheralInc_Enable（外设地址寄存器递增），DMA_PeripheralInc_Disable（外设地址寄存器不变），
	DMA_Initstructure.DMA_MemoryInc           = DMA_MemoryInc_Enable;				  //DMA_MemoryInc_Enable（内存地址寄存器递增），DMA_MemoryInc_Disable（内存地址寄存器不变）
	DMA_Initstructure.DMA_PeripheralDataSize  = DMA_PeripheralDataSize_Byte;	//外设数据宽度--DMA_PeripheralDataSize_Byte（数据宽度为8位），DMA_PeripheralDataSize_HalfWord（数据宽度为16位），DMA_PeripheralDataSize_Word（数据宽度为32位）
	DMA_Initstructure.DMA_MemoryDataSize      = DMA_MemoryDataSize_Byte;		  //内存数据宽度--DMA_MemoryDataSize_Byte（数据宽度为8位），DMA_MemoryDataSize_HalfWord（数据宽度为16位），DMA_MemoryDataSize_Word（数据宽度为32位）
	DMA_Initstructure.DMA_Mode                = DMA_Mode_Normal;						  //DMA工作模式--DMA_Mode_Normal（只传送一次）, DMA_Mode_Circular（不停地传送）
	DMA_Initstructure.DMA_Priority            = DMA_Priority_High; 					  //DMA通道的转输优先级--DMA_Priority_VeryHigh（非常高）DMA_Priority_High（高)，DMA_Priority_Medium（中），DMA_Priority_Low（低）
	DMA_Initstructure.DMA_M2M                 = DMA_M2M_Disable;						  //DMA通道的内存到内存传输--DMA_M2M_Enable(设置为内存到内存传输)，DMA_M2M_Disable（非内存到内存传输）
	DMA_Init(DMAx_Channeltx,&DMA_Initstructure);														  //初始化DMA

	//6)**********DMA接收初始化，外设作为DMA的源端
	DMA_Initstructure.DMA_PeripheralBaseAddr  = (u32)(&USARTx->DR);						//DMA外设源地址
	DMA_Initstructure.DMA_MemoryBaseAddr      = (u32)uart_rxd;						  	//DMA数据内存地址
	DMA_Initstructure.DMA_DIR                 = DMA_DIR_PeripheralSRC;			  //DMA_DIR_PeripheralDST（外设作为DMA的目的端），DMA_DIR_PeripheralSRC（外设作为数据传输的来源）
	DMA_Initstructure.DMA_BufferSize          = dma_size; 								  	//指定DMA通道的DMA缓存的大小
	DMA_Initstructure.DMA_PeripheralInc       = DMA_PeripheralInc_Disable;	  //DMA_PeripheralInc_Enable（外设地址寄存器递增），DMA_PeripheralInc_Disable（外设地址寄存器不变），
	DMA_Initstructure.DMA_MemoryInc           = DMA_MemoryInc_Enable;				  //DMA_MemoryInc_Enable（内存地址寄存器递增），DMA_MemoryInc_Disable（内存地址寄存器不变）
	DMA_Initstructure.DMA_PeripheralDataSize  = DMA_PeripheralDataSize_Byte; 	//外设数据宽度--DMA_PeripheralDataSize_Byte（数据宽度为8位），DMA_PeripheralDataSize_HalfWord（数据宽度为16位），DMA_PeripheralDataSize_Word（数据宽度为32位）
	DMA_Initstructure.DMA_MemoryDataSize      = DMA_MemoryDataSize_Byte;		  //内存数据宽度--DMA_MemoryDataSize_Byte（数据宽度为8位），DMA_MemoryDataSize_HalfWord（数据宽度为16位），DMA_MemoryDataSize_Word（数据宽度为32位）
	DMA_Initstructure.DMA_Mode                = DMA_Mode_Normal;						  //DMA工作模式--DMA_Mode_Normal（只传送一次）, DMA_Mode_Circular（不停地传送）
	DMA_Initstructure.DMA_Priority            = DMA_Priority_High; 					  //DMA通道的转输优先级--DMA_Priority_VeryHigh（非常高）DMA_Priority_High（高)，DMA_Priority_Medium（中），DMA_Priority_Low（低）
	DMA_Initstructure.DMA_M2M                 = DMA_M2M_Disable;						  //DMA通道的内存到内存传输--DMA_M2M_Enable(设置为内存到内存传输)，DMA_M2M_Disable（非内存到内存传输）
	DMA_Init(DMAx_Channelrx,&DMA_Initstructure);														  //初始化DMA	
	
