quanhengwen/STM32F1xWorkSpace19/Driver/WOW/SCR/STM32_USART - 20190813.C
	//8)**********配置相关中断
	//8.1)**********串口接收中断配置
	//--将串口接收中断关闭，然后开启串口空闲中断，利用DMA自动接收串口数据
	//--若DMA接收未开启，则使用串口接收中断
	//--若DMA接收开启，串口接收中断应该关闭，在DMA配置中会将串口接收中断关闭

	/* 启动DMA1通道5*/
	DMA_Cmd(DMAx_Channeltx,DISABLE);				//关闭DMA发送----需要发送时再打开
	//10.2)**********使能串口
	DMA_Cmd(DMAx_Channelrx,ENABLE);					//打开DMA接收----自动接收串口数据	
	//9.1)**********关闭DMA发送	
	
	//8.2)**********使能串口DMA方式接收
	USART_DMACmd(USARTx,USART_DMAReq_Rx,ENABLE);
	//8.3)**********使能串口DMA方式发送
	USART_DMACmd(USARTx,USART_DMAReq_Tx,ENABLE);
	//9)**********清除相关中断标志位	
	//	DMA_Cmd(DMAx_Channeltx,ENABLE);
	//9.2)**********使能相关DMA通道传输完成中断
	DMA_ITConfig(DMAx_Channeltx,DMA_IT_TC, DISABLE);
	//9.3)-------------------------------------清除DMA标志                                 					
	DMA_Clear_Tx_Flag(USARTx);	// 清除串口DMA方式发送中断全局标志
	DMA_Clear_Rx_Flag(USARTx);	// 清除串口DMA方式接收中断全局标志	
}
/*******************************************************************************
*函数名			:	USART_DMA_ConfigurationNr
*功能描述		:	USART_DMA配置--查询方式，不开中断
*输入				: 
*返回值			:	无
*******************************************************************************/
static void usart_it_initialize(USART_TypeDef* USARTx)	//串口GPIO配置
{
	//1)**********定义变量
  NVIC_InitTypeDef 	NVIC_InitStructure; 					//NVIC结构体
  u8 USARTx_IRQChannel=0;

	switch(*(u32*)&USARTx)
	{
		case 	USART1_BASE:
					USARTx_IRQChannel=USART1_IRQChannel;		//中断			
					break;
		case 	USART2_BASE:
          USARTx_IRQChannel=USART2_IRQChannel;		//中断	
					break;
		case 	USART3_BASE:
          USARTx_IRQChannel=USART3_IRQChannel;		//中断					break;
		case 	UART4_BASE:
          USARTx_IRQChannel=UART4_IRQChannel;		//中断
					break;
		case 	UART5_BASE:   //UART5不支持DMA
          USARTx_IRQChannel=UART5_IRQChannel;		//中断	
					break;
		default :break;
	}
	//4)**********串口全局中断初始化
	NVIC_InitStructure.NVIC_IRQChannel = USARTx_IRQChannel;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;     //默认1
	NVIC_InitStructure.NVIC_IRQChannelSubPriority=1;              //默认1
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);
}
//-----------------------------------------------------------------------------



//-----------------------------------------------------------------------------
//---------------------------------static2-------------------------------------
//-----------------------------------------------------------------------------
/*******************************************************************************
*函数名			:	
*功能描述		:	串口DMA发送程序，如果数据已经传入到DMA，返回Buffer大小，否则返回0
*输入				: 
*返回值			:	如果数据已经传入到DMA，返回Buffer大小，否则返回0（发送器忙）
*******************************************************************************/
static unsigned char set_usart_type(USART_TypeDef* USARTx,unsigned char type)
{
	//串口类型0---USART,1-RS485
	if(USART1==USARTx)
		usart_type.nUSART1	=	type;
	if(USART2==USARTx)
		usart_type.nUSART2	=	type;
	if(USART3==USARTx)
		usart_type.nUSART3	=	type;
	if(UART4==USARTx)
		usart_type.nUART4	=	type;
	if(UART5==USARTx)
		usart_type.nUART5	=	type;
	return 0;
}
/*******************************************************************************
*函数名			:	
*功能描述		:	串口DMA发送程序，如果数据已经传入到DMA，返回Buffer大小，否则返回0
*输入				: 
*返回值			:	如果数据已经传入到DMA，返回Buffer大小，否则返回0（发送器忙）
*******************************************************************************/
static unsigned char get_usart_type(USART_TypeDef* USARTx)
{
	//串口类型0---USART,1-RS485
	if(USART1==USARTx)
		return usart_type.nUSART1;
	if(USART2==USARTx)
		return usart_type.nUSART2;
	if(USART3==USARTx)
		return usart_type.nUSART3;
	if(UART4==USARTx)
		return usart_type.nUART4;
	if(UART5==USARTx)
		return usart_type.nUART5;
	return 0;
}
/*******************************************************************************
*函数名			:	
*功能描述		:	串口DMA发送程序，如果数据已经传入到DMA，返回Buffer大小，否则返回0
*输入				: 
*返回值			:	如果数据已经传入到DMA，返回Buffer大小，否则返回0（发送器忙）
*******************************************************************************/
static void set_rs485_addr(RS485Def *pRS485)		//串口DMA发送程序
{
	USART_TypeDef* USARTx	=	pRS485->USARTx;
	if(USART1==USARTx)
		rs485_addr.rs485_usart1	=	pRS485;
	if(USART2==USARTx)
		rs485_addr.rs485_usart2	=	pRS485;
	if(USART3==USARTx)
		rs485_addr.rs485_usart3	=	pRS485;
	if(UART4==USARTx)
		rs485_addr.rs485_uart4	=	pRS485;
	if(UART5==USARTx)
		rs485_addr.rs485_uart5	=	pRS485;
}
/*******************************************************************************
*函数名			:	
*功能描述		:	串口DMA发送程序，如果数据已经传入到DMA，返回Buffer大小，否则返回0
*输入				: 
*返回值			:	如果数据已经传入到DMA，返回Buffer大小，否则返回0（发送器忙）
*******************************************************************************/
static RS485Def* get_rs485_addr(USART_TypeDef* USARTx)		//串口DMA发送程序
{
	if(0==get_usart_type(USARTx))
		return 0;
	if(USART1==USARTx)
		return rs485_addr.rs485_usart1;
	if(USART2==USARTx)
		return rs485_addr.rs485_usart2;
	if(USART3==USARTx)
		return rs485_addr.rs485_usart3;
	if(UART4==USARTx)
		return rs485_addr.rs485_uart4;
	if(UART5==USARTx)
		return rs485_addr.rs485_uart5;
	return 0;
}
/*******************************************************************************
*函数名			:	
*功能描述		:	串口DMA发送程序，如果数据已经传入到DMA，返回Buffer大小，否则返回0
*输入				: 
*返回值			:	如果数据已经传入到DMA，返回Buffer大小，否则返回0（发送器忙）
*******************************************************************************/
static unsigned short set_usart_tx_dma_buffer(USART_TypeDef* USARTx,u8 *tx_buffer,u16 BufferSize)		//串口DMA发送程序
{
	unsigned short conf_buffer_size	=	get_usart_dma_buffer_size(USARTx);
	unsigned char* tx_addr	=	get_usart_tx_data_addr(USARTx);
	
	DMA_Channel_TypeDef*	DMAy_Channelx	=	get_usart_tx_dma_channel(USARTx);
	
	if(BufferSize>conf_buffer_size)
		return 0;		
	memcpy(tx_addr,tx_buffer,BufferSize);
	
	DMAy_Channelx->CCR    &= (u32)0xFFFFFFFE;				//DMA_Cmd(DMA1_Channel4,DISABLE);//DMA发送关闭，只能在DMA关闭情况下才可以写入CNDTR					
	DMAy_Channelx->CNDTR 	=   BufferSize;					  //设定待发送缓冲区大小
	DMAy_Channelx->CMAR 	=   (u32)tx_addr;			  	//发送缓冲区
	DMAy_Channelx->CCR    |=  (u32)0x00000001;			//DMA_Cmd(DMA1_Channel4,ENABLE);//DMA发送开启3
	return BufferSize;
}
/*******************************************************************************
*函数名			:	
*功能描述		:	串口DMA发送程序，如果数据已经传入到DMA，返回Buffer大小，否则返回0
*输入				: 
*返回值			:	如果数据已经传入到DMA，返回Buffer大小，否则返回0（发送器忙）
*******************************************************************************/
static unsigned short get_usart_rx_dma_buffer(USART_TypeDef* USARTx,u8 *RevBuffer)		//串口DMA接收程序
{
	unsigned short length=0;
	unsigned char*	uart_rxd;
	unsigned short 	dma_size;
	DMA_Channel_TypeDef* DMAy_Channelrx;			//DMA接收通道请求信号---DMA串口接收由串口发起中断，因此此处接收通道中断不使用
	
