quanhengwen/STM32F1xWorkSpace19/Driver/WOW/SCR/STM32_USART - 20190813.C
	if(UART5==USARTx)		//UART5不支持DMA
		return 0;
	if(0==uart_rxd)
		return 0;
//	if(0==get_usart_rx_idle(USARTx))
//		return 0;
//	del_usart_rx_idle(USARTx);
//	if(USART_GetFlagStatus(USARTx,USART_FLAG_IDLE))
//	{	
		uart_rxd	=	get_usart_rx_data_addr(USARTx);
		dma_size	=	get_usart_dma_buffer_size(USARTx);

		DMAy_Channelrx=get_usart_rx_dma_channel(USARTx);
		length 	= DMAy_Channelrx->CNDTR;										//DMA_GetCurrDataCounter(DMA1_Channel5);	//得到真正接收数据个数(DMA_GetCurrDataCounter返回当前DMA通道x剩余的待传输数据数目)
		if(length>dma_size)	//超出缓存，避免内存溢出
			return 0;
		length	=	dma_size-length;												 	//设定缓冲区大小减剩余缓冲区大小得到实际接收到的数据个数
		if(0==length)
			return 0;
		DMAy_Channelrx->CCR&= (u32)0xFFFFFFFE;							//DMA_Cmd(DMAx_Channelx,DISABLE);//DMA接收关闭，只能在DMA关闭情况下才可以写入CNDTR
		memcpy(RevBuffer,uart_rxd,length);									//复制指定大小的数据
		//------重新指向接收缓冲区地址并使能DMA接收			
		DMAy_Channelrx->CMAR=(u32)uart_rxd;									//重新设置DMA接收地址
		DMAy_Channelrx->CNDTR=dma_size;			  							//重新设置接收数据个数	
		DMAy_Channelrx->CCR |= ((u32)0x00000001);						//DMA_Cmd(DMAx_Channelrx,ENABLE);//开启接收DMA
		
		USARTx->SR = (u16)~USART_FLAG_IDLE;									//USART_ClearFlag(USARTx,USART_FLAG_IDLE);
		
		set_rx_retry_count(USARTx,0);
		set_usart_rx_capacity_backup(USARTx,dma_size);			//缓存容量
		return length;			//返回接收到的数据个数
//	}

}
//-----------------------------------------------------------------------------



/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static unsigned char* get_usart_rx_data_addr(USART_TypeDef* USARTx)
{
	if(USART1	==	USARTx)
	{
		return uRx1Addr;
	}
	else if(USART2	==	USARTx)
	{
		return uRx2Addr;
	}
	else if(USART3	==	USARTx)
	{
		return uRx3Addr;
	}
	else if(UART4	==	USARTx)
	{
		return uRx4Addr;		
	}
	return 0;
}

/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static unsigned char* get_usart_tx_data_addr(USART_TypeDef* USARTx)
{
	if(USART1	==	USARTx)
	{
		return uTx1Addr;
	}
	else if(USART2	==	USARTx)
	{
		return uTx2Addr;
	}
	else if(USART3	==	USARTx)
	{
		return uTx3Addr;
	}
	else if(UART4	==	USARTx)
	{
		return uTx4Addr;		
	}
	return 0;
}
//-----------------------------------------------------------------------------


/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static unsigned short set_usart_dma_buffer_size(USART_TypeDef* USARTx,unsigned short size)
{
	if(0==size)													//如果未设定缓存大小，使用默认值
		size	=	uart_dma_buffer_size;
	else if(size>uart_dma_buffer_size)	//大于默认缓存
		size	=	uart_dma_buffer_size;
	if(USART1	==	USARTx)
	{
		DmaSize.nUSART1	=	size;
	}
	else if(USART2	==	USARTx)
	{
		DmaSize.nUSART2	=	size;
	}
	else if(USART3	==	USARTx)
	{
		DmaSize.nUSART3	=	size;
	}
	else if(UART4	==	USARTx)
	{
		DmaSize.nUART4	=	size;
	}
	else
		return 0;
	return size;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static unsigned short get_usart_dma_buffer_size(USART_TypeDef* USARTx)
{
	if(USART1	==	USARTx)
	{
		return DmaSize.nUSART1;
	}
	else if(USART2	==	USARTx)
	{
		return DmaSize.nUSART2;
	}
	else if(USART3	==	USARTx)
	{
		return DmaSize.nUSART3;
	}
	else if(UART4	==	USARTx)
	{
		return DmaSize.nUART4;
	}
	return 0;
}
//-----------------------------------------------------------------------------


/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static unsigned short set_usart_rx_capacity_backup(USART_TypeDef* USARTx,unsigned short size)
{
	if(size>uart_dma_buffer_size)	//大于配置容量
		size	=	uart_dma_buffer_size;
	if(USART1	==	USARTx)
	{
		RemaDmaSize.nUSART1	=	size;
	}
	else if(USART2	==	USARTx)
	{
		RemaDmaSize.nUSART2	=	size;

	}
	else if(USART3	==	USARTx)
	{
		RemaDmaSize.nUSART3	=	size;
	}
	else if(UART4	==	USARTx)
	{
		RemaDmaSize.nUART4	=	size;
	}
	else
		return 0;
	return size;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static unsigned short get_usart_rx_capacity_backup(USART_TypeDef* USARTx)
{
	if(USART1	==	USARTx)
	{
		return RemaDmaSize.nUSART1;
	}
	else if(USART2	==	USARTx)
	{
		return RemaDmaSize.nUSART2;
	}
	else if(USART3	==	USARTx)
	{
		return RemaDmaSize.nUSART3;
	}
	else if(UART4	==	USARTx)
	{
		return RemaDmaSize.nUART4;
	}
	return 0;
}
//-----------------------------------------------------------------------------


/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static unsigned short set_tx_retry_count(USART_TypeDef* USARTx,unsigned short count)
{
	if(USART1	==	USARTx)
	{
		tx_retry_count.nUSART1	=	count;
	}
	else if(USART2	==	USARTx)
	{
		tx_retry_count.nUSART2	=	count;
	}
	else if(USART3	==	USARTx)
	{
		tx_retry_count.nUSART3	=	count;
	}
	else if(UART4	==	USARTx)
	{
		tx_retry_count.nUART4	=	count;
	}
	return count;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static unsigned short get_tx_retry_count(USART_TypeDef* USARTx)
{
	if(USART1	==	USARTx)
	{
		return tx_retry_count.nUSART1;
	}
	else if(USART2	==	USARTx)
	{
		return tx_retry_count.nUSART2;
	}
	else if(USART3	==	USARTx)
	{
		return tx_retry_count.nUSART3;
	}
	else if(UART4	==	USARTx)
	{
		return tx_retry_count.nUART4;
	}
	return 0;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static unsigned short set_rx_retry_count(USART_TypeDef* USARTx,unsigned short count)
{
	if(USART1	==	USARTx)
	{
		rx_retry_count.nUSART1	=	count;
	}
	else if(USART2	==	USARTx)
	{
		rx_retry_count.nUSART2	=	count;
	}
	else if(USART3	==	USARTx)
	{
		rx_retry_count.nUSART3	=	count;
	}
	else if(UART4	==	USARTx)
	{
		rx_retry_count.nUART4	=	count;
	}
	return count;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static unsigned short get_rx_retry_count(USART_TypeDef* USARTx)
{
	if(USART1	==	USARTx)
	{
		return rx_retry_count.nUSART1;
	}
	else if(USART2	==	USARTx)
	{
		return rx_retry_count.nUSART2;
	}
	else if(USART3	==	USARTx)
	{
		return rx_retry_count.nUSART3;
	}
	else if(UART4	==	USARTx)
	{
		return rx_retry_count.nUART4;
	}
	return 0;
}
//------------------------------------------------------------------------------


