quanhengwen/STM32F1xWorkSpace19/Driver/WOW/SCR/STM32_USART - 20190813.C
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static DMA_Channel_TypeDef* get_usart_tx_dma_channel(USART_TypeDef* USARTx)
{
	if(USART1	==	USARTx)
	{
		return DMA1_Channel4;
	}
	else if(USART2	==	USARTx)
	{
		return DMA1_Channel7;
	}
	else if(USART3	==	USARTx)
	{
		return DMA1_Channel2;
	}
	else if(UART4	==	USARTx)
	{
		return DMA2_Channel5;
	}
	return 0;	
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static DMA_Channel_TypeDef* get_usart_rx_dma_channel(USART_TypeDef* USARTx)
{
	if(USART1	==	USARTx)
	{
		return DMA1_Channel5;
	}
	else if(USART2	==	USARTx)
	{
		return DMA1_Channel6;
	}
	else if(USART3	==	USARTx)
	{
		return DMA1_Channel3;
	}
	else if(UART4	==	USARTx)
	{
		return DMA2_Channel3;
	}
	return 0;	
}
/*******************************************************************************
*函数名			:	DMA_Clear_Tx_Flag
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void DMA_Clear_Tx_Flag(USART_TypeDef* USARTx)
{
	if(USART1	==	USARTx)
	{
		DMA_ClearFlag(DMA1_FLAG_GL4);                                 					// 清除DMA所有标志
	}
	else if(USART2	==	USARTx)
	{
		DMA_ClearFlag(DMA1_FLAG_GL7);                                 					// 清除DMA所有标志
	}
	else if(USART3	==	USARTx)
	{
		DMA_ClearFlag(DMA1_FLAG_GL2);                                 					// 清除DMA所有标志
	}
	else if(UART4	==	USARTx)
	{
		DMA_ClearFlag(DMA2_FLAG_GL5);                                 					// 清除DMA所有标志
	}
}
/*******************************************************************************
*函数名			:	DMA_Clear_Rx_Flag
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void DMA_Clear_Rx_Flag(USART_TypeDef* USARTx)
{
	if(USART1	==	USARTx)
	{
		DMA_ClearFlag(DMA1_FLAG_GL5);                                 					// 清除DMA所有标志
	}
	else if(USART2	==	USARTx)
	{
		DMA_ClearFlag(DMA1_FLAG_GL6);                                 					// 清除DMA所有标志
	}
	else if(USART3	==	USARTx)
	{
		DMA_ClearFlag(DMA1_FLAG_GL3);                                 					// 清除DMA所有标志
	}
	else if(UART4	==	USARTx)
	{
		DMA_ClearFlag(DMA2_FLAG_GL3);                                 					// 清除DMA所有标志
	}
}
//------------------------------------------------------------------------------



/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	0--非空闲，1--空闲
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static unsigned char set_usart_rx_idle(USART_TypeDef* USARTx)
{	
	//空闲标志0---忙,1-空闲
	if(USART1	==	USARTx)
		usart_rx_idle_flag.nUSART1	=	1;
	if(USART2	==	USARTx)
		usart_rx_idle_flag.nUSART2	=	1;
	if(USART3	==	USARTx)
		usart_rx_idle_flag.nUSART3	=	1;
	if(UART4	==	USARTx)
		usart_rx_idle_flag.nUART4	=	1;
	if(UART5	==	USARTx)
		usart_rx_idle_flag.nUART5	=	1;
	return 0;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	0--非空闲，1--空闲
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static unsigned char set_usart_tx_idle(USART_TypeDef* USARTx)
{
	//空闲标志0---忙,1-空闲
	if(USART1	==	USARTx)
		usart_tx_idle_flag.nUSART1	=	1;
	if(USART2	==	USARTx)
		usart_tx_idle_flag.nUSART2	=	1;
	if(USART3	==	USARTx)
		usart_tx_idle_flag.nUSART3	=	1;
	if(UART4	==	USARTx)
		usart_tx_idle_flag.nUART4	=	1;
	if(UART5	==	USARTx)
		usart_tx_idle_flag.nUART5	=	1;
	return 0;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	0--非空闲，1--空闲
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static unsigned char get_usart_rx_idlebac(USART_TypeDef* USARTx)
{	
	//空闲标志0---忙,1-空闲
	if(USART1	==	USARTx)
	{
		if(USART_GetFlagStatus(USART1,USART_FLAG_IDLE))
			set_usart_rx_idle(USART1);
		return usart_rx_idle_flag.nUSART1;
	}
	if(USART2	==	USARTx)
	{
		if(USART_GetFlagStatus(USART2,USART_FLAG_IDLE))
			set_usart_rx_idle(USART2);
		return usart_rx_idle_flag.nUSART2;
	}
	if(USART3	==	USARTx)
	{
		if(USART_GetFlagStatus(USART3,USART_FLAG_IDLE))
			set_usart_rx_idle(USART3);
		return usart_rx_idle_flag.nUSART3;
	}
	if(UART4	==	USARTx)
	{
		if(USART_GetFlagStatus(UART4,USART_FLAG_IDLE))
			set_usart_rx_idle(UART4);
		return usart_rx_idle_flag.nUART4;
	}
	if(UART5	==	USARTx)
	{
		if(USART_GetFlagStatus(UART5,USART_FLAG_IDLE))
			set_usart_rx_idle(UART5);
		return usart_rx_idle_flag.nUART5;
	}
	return 0;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	0--非空闲，1--空闲
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static unsigned char get_usart_tx_idlebac(USART_TypeDef* USARTx)
{
	//空闲标志0---忙,1-空闲
	if(USART1	==	USARTx)
	{
		if(USART_GetFlagStatus(USART1,USART_FLAG_TC))
		{
			set_usart_tx_idle(USART1);
			USART_ClearFlag(USART1,USART_FLAG_TC);
		}
		return usart_tx_idle_flag.nUSART1;	
	}		
	if(USART2	==	USARTx)	
	{
		if(USART_GetFlagStatus(USART2,USART_FLAG_TC))
		{
			set_usart_tx_idle(USART2);
			USART_ClearFlag(USART2,USART_FLAG_TC);
		}			
		return usart_tx_idle_flag.nUSART2;
	}
	if(USART3	==	USARTx)	
	{
		if(USART_GetFlagStatus(USART3,USART_FLAG_TC))
		{
			set_usart_tx_idle(USART3);
			USART_ClearFlag(USART3,USART_FLAG_TC);
		}
		return usart_tx_idle_flag.nUSART3;
	}
	if(UART4	==	USARTx)
	{
		if(USART_GetFlagStatus(UART4,USART_FLAG_TC))
		{
			set_usart_tx_idle(UART4);
			USART_ClearFlag(UART4,USART_FLAG_TC);
		}
		return usart_tx_idle_flag.nUART4;
	}
	if(UART5	==	USARTx)
	{
		if(USART_GetFlagStatus(UART5,USART_FLAG_TC))
		{
			set_usart_tx_idle(UART5);
			USART_ClearFlag(UART5,USART_FLAG_TC);
		}
		return usart_tx_idle_flag.nUART5;
	}
	return 0;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	0--非空闲，1--空闲
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static unsigned char del_usart_rx_idle(USART_TypeDef* USARTx)
{	
	//空闲标志0---忙,1-空闲
	if(USART1	==	USARTx)
		usart_rx_idle_flag.nUSART1	=	0;
	if(USART2	==	USARTx)
		usart_rx_idle_flag.nUSART2	=	0;
	if(USART3	==	USARTx)
		usart_rx_idle_flag.nUSART3	=	0;
	if(UART4	==	USARTx)
		usart_rx_idle_flag.nUART4		=	0;
	if(UART5	==	USARTx)
		usart_rx_idle_flag.nUART5		=	0;
	return 0;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	0--非空闲，1--空闲
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static unsigned char del_usart_tx_idle(USART_TypeDef* USARTx)
{
	//空闲标志0---忙,1-空闲
	if(USART1	==	USARTx)
		usart_tx_idle_flag.nUSART1	=	0;
	if(USART2	==	USARTx)
		usart_tx_idle_flag.nUSART2	=	0;
	if(USART3	==	USARTx)
		usart_tx_idle_flag.nUSART3	=	0;
	if(UART4	==	USARTx)
		usart_tx_idle_flag.nUART4	=	0;
	if(UART5	==	USARTx)
		usart_tx_idle_flag.nUART5	=	0;
	return 0;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	0--非空闲，1--空闲
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static unsigned char get_usart_rx_idle(USART_TypeDef* USARTx)
{	
	//-----------------接收空闲检测：IDLE空闲标志,DMA缓存满，DMA缓存未占用，DMA缓存占用后没变化，DMA未开启
	unsigned short	capacity	=	0;			//剩余缓存大小
	
	
	unsigned short	dma_conf_size							=	get_usart_dma_buffer_size(USARTx);	
	DMA_Channel_TypeDef*	DMAy_Channelx				=	get_usart_rx_dma_channel(USARTx);	
	
	capacity	=	DMAy_Channelx->CNDTR;		      //获取DMA接收缓存剩余空间
	//-----------------空闲标志
	if(USART_GetFlagStatus(USARTx,USART_FLAG_IDLE))		//检测发送数据寄存器是否为空	RESET-非空，SET-空，
	{
		USART_ClearFlag(USARTx,USART_FLAG_IDLE);
		return 1;			//空闲
	}
	//-----------------DMA缓存满
	if(capacity==0)
	{
		return 1;
	}
	//-----------------DMA缓存未占用
	if(capacity==dma_conf_size)
	{
		return 1;
	}
	//-----------------DMA缓存占用后没变化
	if(capacity<dma_conf_size)	//缓存已使用：检查是否还在使用
	{	
		unsigned short	dma_conf_capacity_backup	=	get_usart_rx_capacity_backup(USARTx);			//剩余缓存大小
		unsigned short	rxdelay		=	get_rx_retry_count(USARTx);
		//---------------缓存无变化
		if(capacity	==	dma_conf_capacity_backup)
		{
			if(rxdelay<=2)
			{
				rxdelay++;
				set_rx_retry_count(USARTx,rxdelay);
			}
			else
			{
				return 1;
			}
		}
		else	//数量有变化
		{
			set_rx_retry_count(USARTx,0);
			set_usart_rx_capacity_backup(USARTx,capacity);
			return 0;
		}
	}
	return 0;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	0--非空闲，1--空闲
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned char get_usart_tx_idle(USART_TypeDef* USARTx)
{
	//-----------------发送空闲检测：TC发送完成标志,TXE缓存空,，DMA缓存空，DMA未开启
	unsigned short	txdelay		=	get_tx_retry_count(USARTx);

	DMA_Channel_TypeDef*	DMAy_Channelx	=	get_usart_tx_dma_channel(USARTx);	
	//-----------------TC发送完成标志
	if(USART_GetFlagStatus(USARTx,USART_FLAG_TC))		//检测发送数据寄存器是否为空	RESET-非空，SET-空
	{
		set_tx_retry_count(USARTx,0);
		DMA_Cmd(DMAy_Channelx,DISABLE);
		USART_ClearFlag(USARTx,USART_FLAG_TC);
		USART_ClearFlag(USARTx,USART_FLAG_TXE);
		return 1;				//发送空闲
	}
	//------------------DMA未开启
	if(0	==	(DMAy_Channelx->CCR&0x00000001))	//dma未开
	{
		return 1;				//发送空闲
	}
	//------------------DMA缓存空，TXE缓存空
	if((0==DMAy_Channelx->CNDTR)&&(USART_GetFlagStatus(USARTx,USART_FLAG_TXE)))
	{	
		if(txdelay<2)
		{
			txdelay+=1;
			set_tx_retry_count(USARTx,txdelay);
			return 0;				//发送空闲
		}
		else
		{
			DMA_Cmd(DMAy_Channelx,DISABLE);
			USART_ClearFlag(USARTx,USART_FLAG_TXE);
			set_tx_retry_count(USARTx,0);
			return 1;				//发送空闲
		}
	}
	return 0;
}
//----------------------------------------------------------------



