quanhengwen/STM32F1xWorkSpace19/Driver/WOW/SCR/STM32_USART - 20190813.C
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void set_rs485_tx(RS485Def *pRS485,FunctionalState NewState)
{
	//----------------txen脚高为发送
	//----------------rxen脚低为接收
	if(pRS485->RS485_TxEn_PORT)
	{
		if (NewState != DISABLE)
		{
			pRS485->RS485_TxEn_PORT->BSRR		= pRS485->RS485_TxEn_Pin;
		}
		else
		{
			pRS485->RS485_TxEn_PORT->BRR 		= pRS485->RS485_TxEn_Pin;
		}
	}
	if(pRS485->RS485_CTL_PORT)
	{
		if (NewState != DISABLE)
		{
			pRS485->RS485_CTL_PORT->BSRR		= pRS485->RS485_CTL_Pin;
		}
		else
		{
			pRS485->RS485_CTL_PORT->BRR 		= pRS485->RS485_CTL_Pin;
		}
	}  
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void set_rs485_rx(RS485Def *pRS485,FunctionalState NewState)
{
	//----------------txen脚高为发送
	//----------------rxen脚低为接收
	if(pRS485->RS485_RxEn_PORT)
	{
		if (NewState != DISABLE)
		{
			pRS485->RS485_RxEn_PORT->BRR 		= pRS485->RS485_RxEn_Pin;			
		}
		else
		{
			pRS485->RS485_RxEn_PORT->BSRR		= pRS485->RS485_RxEn_Pin;
		}
	}
	if(pRS485->RS485_CTL_PORT)
	{
		if (NewState != DISABLE)
		{
			pRS485->RS485_CTL_PORT->BRR 		= pRS485->RS485_CTL_Pin;			
		}
		else
		{
			pRS485->RS485_CTL_PORT->BSRR		= pRS485->RS485_CTL_Pin;
		}
	}   
}
//----------------------------------------------------------------






/*******************************************************************************
*函数名			:	USART_ConfigurationIT
*功能描述		:	USART_配置---常规中断方式
*输入				: 
*返回值			:	无
*修改时间		:	2018/01/06
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void	USART_Send(USART_TypeDef* USARTx,u8* TxdBuffer,u16 Lengh)
{
	u8 Temp	=	0;
	u16	Len	=	0;
	while(Len<Lengh)
	{
		while(USART_GetFlagStatus(USARTx, USART_FLAG_TXE)!=SET)
		{			
		}
		Temp=*TxdBuffer;
		USART_SendData(USARTx, Temp);
		TxdBuffer++;
		Len++;
	}
}
/*******************************************************************************
*函数名			:	USART_ConfigurationIT
*功能描述		:	USART_配置---常规中断方式
*输入				: 
*返回值			:	无
*修改时间		:	2018/01/06
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void	USART_TxServer(USART_TypeDef* USARTx)
{
}
/*******************************************************************************
*函数名		:USART_RX_Server
*功能描述	:串口接收服务函数
*输入			: 
*输出			:无
*返回值		:无
*例程			：
*******************************************************************************/

void USART_RxServer(USART_TypeDef* USARTx)		//串口接收服务程序	
{

}
/*******************************************************************************
*函数名		:USART_RX_Server
*功能描述	:串口接收服务函数
*输入			: 
*输出			:无
*返回值		:无
*例程			：
*******************************************************************************/

void USART_Process(void)		//串口服务程序	
{
  USART_TxServer(USART1);
  USART_TxServer(USART2);
  USART_TxServer(USART3);
  USART_TxServer(UART4);
  USART_TxServer(UART5);
}


/*******************************************************************************
* 函数名		:	
* 功能描述	:	printf重定义 
* 输入		:	
* 输出		:
* 返回 		:
*******************************************************************************/
int fputc(int ch, FILE *f)	//printf重定义
{

	USART_SendData(USART1, (unsigned char) ch);// USART1 可以换成 USART2 等

	while(!(USART_GetFlagStatus(USART2, USART_FLAG_TXE) == SET));

	return (ch);

}

  
/*******************************************************************************
* 函数名		:	
* 功能描述	:	 
* 输入		:	
* 输出		:
* 返回 		:
*******************************************************************************/
//int fgetc(FILE *f)
//{
// 
//	while(!(USART_GetFlagStatus(USART1, USART_FLAG_RXNE) == SET))
//	{
//	}
//	return (USART_ReceiveData(USART1));
//}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	
*******************************************************************************/
unsigned char UART5ReceiveData(unsigned char* RecByte)			//串口5读数据,返回0-无中断，返回1有中断无数据（发送中断），返回2-有中断有接收到数据
{
	//==============================Port5
	if(USART_GetITStatus(UART5, USART_IT_RXNE))
  {
		*RecByte	=	USART_ReceiveData(UART5);
	
		USART_ClearITPendingBit(UART5, USART_IT_RXNE);
		return 2;
	}
	else if(USART_GetITStatus(UART5, USART_IT_TC))
  {   
    USART_ClearITPendingBit(UART5, USART_IT_TC);
		return 1;
  }
	return 0;
}
//-----------------------------------------------------------------------------
//-----------------------------------------------------------------------------





//-----------------------------------------------------------------------------串口收发
/*******************************************************************************
* Function Name  : USART1_IRQHandler
* Description    : This function handles USART1 global interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void USART1_IRQHandler(void)
{
	//--------------------------------------------------------发送中断
	if(USART_GetITStatus(USART1,USART_IT_TC))
	{
		USART_ClearITPendingBit(USART1,USART_IT_TC);
		if(get_usart_type(USART1))		//串口类型：0---USART,1-RS485
		{
			RS485Def*	pRS485	=	get_rs485_addr(USART1);
			if(0==pRS485)
				return;
			set_rs485_tx(pRS485,DISABLE);
			set_rs485_rx(pRS485,ENABLE);
			set_usart_tx_idle(USART1);
		}
	}
	//--------------------------------------------------------接收空闲中断
	if(USART_GetITStatus(USART1,USART_IT_IDLE))
	{
		USART_ClearITPendingBit(USART1,USART_IT_IDLE);
		if(get_usart_type(USART1))		//串口类型：0---USART,1-RS485
		{
			RS485Def*	pRS485	=	get_rs485_addr(USART1);
			if(0==pRS485)
				return;
			set_usart_rx_idle(USART1);
		}
	}	
}
/*******************************************************************************
* Function Name  : USART2_IRQHandler
* Description    : This function handles USART2 global interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void USART2_IRQHandler(void)
{
//--------------------------------------------------------发送中断
	if(USART_GetITStatus(USART2,USART_IT_TC))
	{
		USART_ClearITPendingBit(USART2,USART_IT_TC);
		if(get_usart_type(USART2))		//串口类型：0---USART,1-RS485
		{
			RS485Def*	pRS485	=	get_rs485_addr(USART2);
			if(0==pRS485)
				return;
			set_rs485_tx(pRS485,DISABLE);
			set_rs485_rx(pRS485,ENABLE);			
		}
		set_usart_tx_idle(USART2);
	}
	//--------------------------------------------------------接收空闲中断
	if(USART_GetITStatus(USART2,USART_IT_IDLE))
	{
		USART_ClearITPendingBit(USART2,USART_IT_IDLE);
		if(get_usart_type(USART2))		//串口类型：0---USART,1-RS485
		{
			RS485Def*	pRS485	=	get_rs485_addr(USART2);
			if(0==pRS485)
				return;
		}
		set_usart_rx_idle(USART2);
	}
}







